import pytest
import pandas as pd


@pytest.fixture(scope='module')
def sample_df():
    data = {
        'Дата операции': ['01.01.2023 12:00:00', '07.01.2023 15:30:00',
                         '15.01.2023 10:15:00', '25.01.2023 18:45:00'],
        'Описание': ['Операция 1', 'Операция 2', 'Операция 3', 'Операция 4']
    }
    return pd.DataFrame(data)


@pytest.fixture
def mock_df():
    data = [
        {'Дата операции': '31.12.2021 16:44:00', 'Номер карты': '*1234', 'Сумма платежа': -100.0},
        {'Дата операции': '31.12.2021 16:44:00', 'Номер карты': '*1234', 'Сумма платежа': -200.0},
        {'Дата операции': '31.12.2021 16:44:00', 'Номер карты': '*5678', 'Сумма платежа': -300.0},
        {'Дата операции': '31.12.2021 16:44:00', 'Номер карты': '*5678', 'Сумма платежа': -400.0},
        {'Дата операции': '31.12.2021 16:44:00', 'Номер карты': '*3333', 'Сумма платежа': 50.0},
    ]
    return pd.DataFrame(data)
